{"pageProps":{"posts":[{"id":"4731a80e-c98e-4140-a26d-1c60adcdcee8","Tags":["Cybersecurity"],"Date":"2020-05-08","Description":"Data is the new oil and the global IT firms are behind your data. Why do companies like Google, Facebook, and Amazon allows you to upload unlimited data to their cloud?","Name":"What's the big deal with privacy?"},{"id":"dee291be-d843-4943-826c-07b444693aae","Date":"2020-04-18","Description":"Mongoose is a elegant MongoDB object modeling for node.js.It manages relationships between data,provides schema validation, and is used to translate between objects in code and the representation of those objects in MongoDB","Name":"Working with Mongoose populate"},{"id":"10fc9004-586e-425c-8115-dc4198ca506a","Date":"2020-04-16","Description":"Hope you all are doing well, I don’t need to tell you how disruptive the coronavirus is and huge swaths of the population are now forced to work from home. Over 90% people have been subject to stay in place quarantines.Everybody knew the importance of the Internet but nobody thought that someday ","Name":"Isn’t Crashing the Internet… Yet?"},{"id":"0e604fa6-5213-4b44-ae22-8565a49c3642","Date":"2020-03-01","Description":"WhatsApp Messenger, or simply WhatsApp is a freeware, cross-platform messaging and Voice over IP (VoIP) service owned by Facebook, Inc. It allows users to send text messages and voice messages, make voice and video calls, and share images","Name":"A Noob Guide On Building Your Own Whatsapp Sticker app"},{"id":"3417ee1a-22af-47b6-9859-58ff13df4a7a","Date":"2019-12-31","Description":"I had a chance of attending my first jeopardy CTF competition on 28th December 2019. As an infosec conference first-timer I would like to share my experience.","Name":"Journey of my first CTF (InCTF 2019)"},{"id":"ea2bd8ce-1cc8-4082-8cb2-544060848340","Date":"2019-07-28","Description":"I've been doing a lot of Linux installations lately and one very annoying thing that I found in 2 laptops was the non availability of WiFi driver. Apparently, it's a new hardware and is not in the Linux kernel.","Name":"Install Realtek WiFi driver for GNU/Linux"},{"id":"56242bdb-d1bc-41cd-aacf-5b222da9894b","Date":"2019-07-14","Description":"if you have named a branch incorrectly and pushed to the remote repository or more precisely if you think you have messed up then follow this steps","Name":"Rename a local and remote branch in git"},{"id":"4d2defd5-91ed-45cc-b8f4-e1994c8f94be","Date":"2019-07-20","Description":"A version control system is a kind of database for storing your software project source code. It lets you save a snapshot of your complete project at any time you want. When you later take a look at an older snapshot (let's start calling it \"version\").","Name":"Git For Newbies"}]},"__N_SSG":true}